public class Description {
  /** Описание проекта:
   * написать программу, которая будет анализировать продажи
   * 2 класса: артикул и транзакция (без чеков, пока)
   * article (id, name, category,
   department, purchase price,
   retail price)
   * transaction (date, article id, article name, quantity)
   * транзакция-запись, а не класс
   * За какие периоды анализировать продажи:
   * 1. за указанный период
   * 2. за указанный месяц
   * 3. за указанную неделю
   * 4. за год
   * 5. за текущий день
   * Что умеет считать:
   * 1.считает продажи, с учетом возвратов (оборот, прибыль)
   * 2.может показать продажи по артикулу, категории, департаменту
   * 3. может показать топ 10 артикулов в категории, в департаменте
   * 4.может показать топ 10 возвратов в категории, в департаменте
   * подумать, в каких файлах и как будет храниться информация
   */

}
